START = '''
Привет. Я телеграм бот для <b>создания SMM контента</b> для продвижения ваших продуктов на разных платформах
'''

HELP = '''
Вы можете описать содержание SMM контента, а я буду генерировать контент на основе этих данных. 

Под каждым моим ответом по контенту, вы можете найти кнопку <i>добавить контекст</i>, которая добавляет доп данные для вашего контента и перегенерирует контент на основе добавленных данных.

Например, мы можете написать:
* сделай пост более веселым
* напиши более официальным языком
* и так далее (зависит от вашей фантазией)
'''

FEEDBACK = '''
Оставьте отзыв о обо мне
* что вы бы хотели видеть или изменить
* или можете меня просто похвалить
'''

ADD_CONTEXT = '''
Пожалуйста добавьте больше информации к предыдущему посту
'''

TO_ADD_CONTEXT = '''
Нажмите /add - добавить доппольнительную информацию к предыдущему сообщению или /new - чтобы создать новый пост
'''

DID_NOT_UNDERSTAND = '''
Я не понял вас, воспользуйтесь меню или /help чтобы узнать какие функционалы есть
'''

SEND_NEW_POST = '''
Вы можете мне отправить описание нового контента
'''
